avrxml/AS6-Devices-XML/ATSAM3U2E.xml
        <register caption="SMC ECC Parity 0 Register" name="SMC_ECC_PR0" offset="0x02C" rw="R" size="4">
          <bitfield caption="Bit Address" mask="0x0000000F" name="BITADDR"/>
          <bitfield caption="Word Address" mask="0x0000FFF0" name="WORDADDR"/>
        </register>
        <register caption="SMC ECC parity 1 Register" name="SMC_ECC_PR1" offset="0x030" rw="R" size="4">
          <bitfield caption="Parity N" mask="0x0000FFFF" name="NPARITY"/>
        </register>
        <register caption="SMC ECC status 2 Register" name="SMC_ECC_SR2" offset="0x034" rw="R" size="4">
          <bitfield caption="Recoverable Error in the page between the 2048th and the 2303rd bytes" mask="0x00000001" name="RECERR8"/>
          <bitfield caption="ECC Error in the page between the 2048th and the 2303rd bytes" mask="0x00000006" name="ECCERR8"/>
          <bitfield caption="Recoverable Error in the page between the 2304th and the 2559th bytes" mask="0x00000010" name="RECERR9"/>
          <bitfield caption="ECC Error in the page between the 2304th and the 2559th bytes" mask="0x00000020" name="ECCERR9"/>
          <bitfield caption="Multiple Error in the page between the 2304th and the 2559th bytes" mask="0x00000040" name="MULERR9"/>
          <bitfield caption="Recoverable Error in the page between the 2560th and the 2815th bytes" mask="0x00000100" name="RECERR10"/>
          <bitfield caption="ECC Error in the page between the 2560th and the 2815th bytes" mask="0x00000200" name="ECCERR10"/>
          <bitfield caption="Multiple Error in the page between the 2560th and the 2815th bytes" mask="0x00000400" name="MULERR10"/>
          <bitfield caption="Recoverable Error in the page between the 2816th and the 3071st bytes" mask="0x00001000" name="RECERR11"/>
          <bitfield caption="ECC Error in the page between the 2816th and the 3071st bytes" mask="0x00002000" name="ECCERR11"/>
          <bitfield caption="Multiple Error in the page between the 2816th and the 3071st bytes" mask="0x00004000" name="MULERR11"/>
          <bitfield caption="Recoverable Error in the page between the 3072nd and the 3327th bytes" mask="0x00010000" name="RECERR12"/>
          <bitfield caption="ECC Error in the page between the 3072nd and the 3327th bytes" mask="0x00060000" name="ECCERR12"/>
          <bitfield caption="Recoverable Error in the page between the 3328th and the 3583rd bytes" mask="0x00100000" name="RECERR13"/>
          <bitfield caption="ECC Error in the page between the 3328th and the 3583rd bytes" mask="0x00600000" name="ECCERR13"/>
          <bitfield caption="Recoverable Error in the page between the 3584th and the 3839th bytes" mask="0x01000000" name="RECERR14"/>
          <bitfield caption="ECC Error in the page between the 3584th and the 3839th bytes" mask="0x06000000" name="ECCERR14"/>
          <bitfield caption="Recoverable Error in the page between the 3840th and the 4095th bytes" mask="0x10000000" name="RECERR15"/>
          <bitfield caption="ECC Error in the page between the 3840th and the 4095th bytes" mask="0x60000000" name="ECCERR15"/>
        </register>
        <register caption="SMC ECC parity 2 Register" name="SMC_ECC_PR2" offset="0x038" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000FF8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x00FFF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 3 Register" name="SMC_ECC_PR3" offset="0x03C" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000FF8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x00FFF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 4 Register" name="SMC_ECC_PR4" offset="0x040" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000FF8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x00FFF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 5 Register" name="SMC_ECC_PR5" offset="0x044" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000FF8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x00FFF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 6 Register" name="SMC_ECC_PR6" offset="0x048" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000FF8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x00FFF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 7 Register" name="SMC_ECC_PR7" offset="0x04C" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 512) and ((i + 1) x 512) - 1) Bytes" mask="0x00000FF8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x00FFF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 8 Register" name="SMC_ECC_PR8" offset="0x050" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x000007F8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x007FF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 9 Register" name="SMC_ECC_PR9" offset="0x054" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x000007F8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x007FF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 10 Register" name="SMC_ECC_PR10" offset="0x058" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x000007F8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x007FF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 11 Register" name="SMC_ECC_PR11" offset="0x05C" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x000007F8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x007FF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 12 Register" name="SMC_ECC_PR12" offset="0x060" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x000007F8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x007FF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 13 Register" name="SMC_ECC_PR13" offset="0x064" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x000007F8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x007FF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 14 Register" name="SMC_ECC_PR14" offset="0x068" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x000007F8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x007FF000" name="NPARITY"/>
        </register>
        <register caption="SMC ECC parity 15 Register" name="SMC_ECC_PR15" offset="0x06C" rw="R" size="4">
          <bitfield caption="Corrupted Bit Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x00000007" name="BITADDR"/>
          <bitfield caption="Corrupted Word Address in the Page between (i x 256) and ((i + 1) x 512) - 1) Bytes" mask="0x000007F8" name="WORDADDR"/>
          <bitfield caption="Parity N" mask="0x007FF000" name="NPARITY"/>
        </register>
        <register caption="SMC Setup Register (CS_number = 0)" name="SMC_SETUP0" offset="0x70" rw="RW" size="4">
          <bitfield caption="NWE Setup Length" mask="0x0000003F" name="NWE_SETUP"/>
          <bitfield caption="NCS Setup Length in Write Access" mask="0x00003F00" name="NCS_WR_SETUP"/>
          <bitfield caption="NRD Setup Length" mask="0x003F0000" name="NRD_SETUP"/>
          <bitfield caption="NCS Setup Length in Read Access" mask="0x3F000000" name="NCS_RD_SETUP"/>
        </register>
