avrxml/AS6-Devices-XML/ATSAM3U2E.xml
        <register caption="UDPHS Endpoint Control Disable Register (endpoint = 2)" name="UDPHS_EPTCTLDIS2" offset="0x148" rw="W" size="4">
          <bitfield caption="Endpoint Disable" mask="0x00000001" name="EPT_DISABL"/>
          <bitfield caption="Packet Auto-Valid Disable" mask="0x00000002" name="AUTO_VALID"/>
          <bitfield caption="Interrupts Disable DMA" mask="0x00000008" name="INTDIS_DMA"/>
          <bitfield caption="NYET Enable (Only for High Speed Bulk OUT endpoints)" mask="0x00000010" name="NYET_DIS"/>
          <bitfield caption="DATAx Interrupt Disable (Only for High Bandwidth Isochronous OUT endpoints)" mask="0x00000040" name="DATAX_RX"/>
          <bitfield caption="MDATA Interrupt Disable (Only for High Bandwidth Isochronous OUT endpoints)" mask="0x00000080" name="MDATA_RX"/>
          <bitfield caption="Overflow Error Interrupt Disable" mask="0x00000100" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data Interrupt Disable" mask="0x00000200" name="RX_BK_RDY"/>
          <bitfield caption="Transmitted IN Data Complete Interrupt Disable" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready/Transaction Error Interrupt Disable" mask="0x00000800" name="TX_PK_RDY"/>
          <bitfield caption="TX Packet Ready/Transaction Error Interrupt Disable" mask="0x00000800" name="ERR_TRANS"/>
          <bitfield caption="Received SETUP/Error Flow Interrupt Disable" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Received SETUP/Error Flow Interrupt Disable" mask="0x00001000" name="ERR_FL_ISO"/>
          <bitfield caption="Stall Sent/ISO CRC Error/Number of Transaction Error Interrupt Disable" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="Stall Sent/ISO CRC Error/Number of Transaction Error Interrupt Disable" mask="0x00002000" name="ERR_CRISO"/>
          <bitfield caption="Stall Sent/ISO CRC Error/Number of Transaction Error Interrupt Disable" mask="0x00002000" name="ERR_NBTRA"/>
          <bitfield caption="NAKIN/bank flush error Interrupt Disable" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAKIN/bank flush error Interrupt Disable" mask="0x00004000" name="ERR_FLUSH"/>
          <bitfield caption="NAKOUT Interrupt Disable" mask="0x00008000" name="NAK_OUT"/>
          <bitfield caption="Busy Bank Interrupt Disable" mask="0x00040000" name="BUSY_BANK"/>
          <bitfield caption="Short Packet Interrupt Disable" mask="0x80000000" name="SHRT_PCKT"/>
        </register>
        <register caption="UDPHS Endpoint Control Register (endpoint = 2)" name="UDPHS_EPTCTL2" offset="0x14C" rw="R" size="4">
          <bitfield caption="Endpoint Enable" mask="0x00000001" name="EPT_ENABL"/>
          <bitfield caption="Packet Auto-Valid Enabled (Not for CONTROL Endpoints)" mask="0x00000002" name="AUTO_VALID"/>
          <bitfield caption="Interrupt Disables DMA" mask="0x00000008" name="INTDIS_DMA"/>
          <bitfield caption="NYET Disable (Only for High Speed Bulk OUT endpoints)" mask="0x00000010" name="NYET_DIS"/>
          <bitfield caption="DATAx Interrupt Enabled (Only for High Bandwidth Isochronous OUT endpoints)" mask="0x00000040" name="DATAX_RX"/>
          <bitfield caption="MDATA Interrupt Enabled (Only for High Bandwidth Isochronous OUT endpoints)" mask="0x00000080" name="MDATA_RX"/>
          <bitfield caption="Overflow Error Interrupt Enabled" mask="0x00000100" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data Interrupt Enabled" mask="0x00000200" name="RX_BK_RDY"/>
          <bitfield caption="Transmitted IN Data Complete Interrupt Enabled" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready/Transaction Error Interrupt Enabled" mask="0x00000800" name="TX_PK_RDY"/>
          <bitfield caption="TX Packet Ready/Transaction Error Interrupt Enabled" mask="0x00000800" name="ERR_TRANS"/>
          <bitfield caption="Received SETUP/Error Flow Interrupt Enabled" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Received SETUP/Error Flow Interrupt Enabled" mask="0x00001000" name="ERR_FL_ISO"/>
          <bitfield caption="Stall Sent/ISO CRC Error/Number of Transaction Error Interrupt Enabled" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="Stall Sent/ISO CRC Error/Number of Transaction Error Interrupt Enabled" mask="0x00002000" name="ERR_CRISO"/>
          <bitfield caption="Stall Sent/ISO CRC Error/Number of Transaction Error Interrupt Enabled" mask="0x00002000" name="ERR_NBTRA"/>
          <bitfield caption="NAKIN/Bank Flush Error Interrupt Enabled" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAKIN/Bank Flush Error Interrupt Enabled" mask="0x00004000" name="ERR_FLUSH"/>
          <bitfield caption="NAKOUT Interrupt Enabled" mask="0x00008000" name="NAK_OUT"/>
          <bitfield caption="Busy Bank Interrupt Enabled" mask="0x00040000" name="BUSY_BANK"/>
          <bitfield caption="Short Packet Interrupt Enabled" mask="0x80000000" name="SHRT_PCKT"/>
        </register>
        <register caption="UDPHS Endpoint Set Status Register (endpoint = 2)" name="UDPHS_EPTSETSTA2" offset="0x154" rw="W" size="4">
          <bitfield caption="Stall Handshake Request Set" mask="0x00000020" name="FRCESTALL"/>
          <bitfield caption="KILL Bank Set (for IN Endpoint)" mask="0x00000200" name="KILL_BANK"/>
          <bitfield caption="TX Packet Ready Set" mask="0x00000800" name="TX_PK_RDY"/>
        </register>
        <register caption="UDPHS Endpoint Clear Status Register (endpoint = 2)" name="UDPHS_EPTCLRSTA2" offset="0x158" rw="W" size="4">
          <bitfield caption="Stall Handshake Request Clear" mask="0x00000020" name="FRCESTALL"/>
          <bitfield caption="Data Toggle Clear" mask="0x00000040" name="TOGGLESQ"/>
          <bitfield caption="Received OUT Data Clear" mask="0x00000200" name="RX_BK_RDY"/>
          <bitfield caption="Transmitted IN Data Complete Clear" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="Received SETUP/Error Flow Clear" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Received SETUP/Error Flow Clear" mask="0x00001000" name="ERR_FL_ISO"/>
          <bitfield caption="Stall Sent/Number of Transaction Error Clear" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="Stall Sent/Number of Transaction Error Clear" mask="0x00002000" name="ERR_NBTRA"/>
          <bitfield caption="NAKIN/Bank Flush Error Clear" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAKIN/Bank Flush Error Clear" mask="0x00004000" name="ERR_FLUSH"/>
          <bitfield caption="NAKOUT Clear" mask="0x00008000" name="NAK_OUT"/>
        </register>
        <register caption="UDPHS Endpoint Status Register (endpoint = 2)" name="UDPHS_EPTSTA2" offset="0x15C" rw="R" size="4">
          <bitfield caption="Stall Handshake Request" mask="0x00000020" name="FRCESTALL"/>
          <bitfield caption="Toggle Sequencing" mask="0x000000C0" name="TOGGLESQ_STA" values="UDPHS_EPTSTA2__TOGGLESQ_STA"/>
          <bitfield caption="Overflow Error" mask="0x00000100" name="ERR_OVFLW"/>
          <bitfield caption="Received OUT Data/KILL Bank" mask="0x00000200" name="RX_BK_RDY"/>
          <bitfield caption="Received OUT Data/KILL Bank" mask="0x00000200" name="KILL_BANK"/>
          <bitfield caption="Transmitted IN Data Complete" mask="0x00000400" name="TX_COMPLT"/>
          <bitfield caption="TX Packet Ready/Transaction Error" mask="0x00000800" name="TX_PK_RDY"/>
          <bitfield caption="TX Packet Ready/Transaction Error" mask="0x00000800" name="ERR_TRANS"/>
          <bitfield caption="Received SETUP/Error Flow" mask="0x00001000" name="RX_SETUP"/>
          <bitfield caption="Received SETUP/Error Flow" mask="0x00001000" name="ERR_FL_ISO"/>
          <bitfield caption="Stall Sent/CRC ISO Error/Number of Transaction Error" mask="0x00002000" name="STALL_SNT"/>
          <bitfield caption="Stall Sent/CRC ISO Error/Number of Transaction Error" mask="0x00002000" name="ERR_CRISO"/>
          <bitfield caption="Stall Sent/CRC ISO Error/Number of Transaction Error" mask="0x00002000" name="ERR_NBTRA"/>
          <bitfield caption="NAK IN/Bank Flush Error" mask="0x00004000" name="NAK_IN"/>
          <bitfield caption="NAK IN/Bank Flush Error" mask="0x00004000" name="ERR_FLUSH"/>
          <bitfield caption="NAK OUT" mask="0x00008000" name="NAK_OUT"/>
          <bitfield caption="Current Bank/Control Direction" mask="0x00030000" name="CURRENT_BANK"/>
          <bitfield caption="Current Bank/Control Direction" mask="0x00030000" name="CONTROL_DIR"/>
          <bitfield caption="Busy Bank Number" mask="0x000C0000" name="BUSY_BANK_STA" values="UDPHS_EPTSTA2__BUSY_BANK_STA"/>
          <bitfield caption="UDPHS Byte Count" mask="0x7FF00000" name="BYTE_COUNT"/>
          <bitfield caption="Short Packet" mask="0x80000000" name="SHRT_PCKT"/>
        </register>
